# Prog-01: Ascii Art
# 6332031221 พิมพ์รัก อภิรัชตานนท์
# ข้าพเจ้าได้ออกแบบและพัฒนาโปรแกรมนี้ด้วยตนเอง

print("███████████████████████████████")
print("█████    █████████████    █████")
print("████  ██  ███     ███  ██  ████")
print("████                       ████")
print("███                         ███")
print("██      ███         ███      ██")
print("██     ██ ██       ██ ██     ██")
print("█       ███         ███       █")
print("█                             █")
print("█          █████████          █")
print("█         █████ █████         █")
print("██        ██ █████ ██        ██")
print("███       ███     ███       ███")
print("████       █████████       ████")
print("██████                   ██████")
print("███████████████████████████████")